        01  CUSTPROF.
            05  CRACTN	PIC X(4).
            05  CRBRNO	PIC X(2).
            05  CRNBRN	PIC X(2).
            05  CRPTYP	PIC X(1).
            05  CRSTCD	PIC X(1).
            05  CRSCON	PIC X(1).
            05  CRICTL	PIC X(1).
            05  CRNTFL	PIC X(4).
            05  FILLER1	PIC X(1).
            05  CRRDUD	PIC X(1).
            05  CRMBS6	PIC X(1).
            05  FILLER2	PIC X(5).
            05  CRLACD	PIC X(1).
            05  CRLACE	PIC X(1).
            05  CRENTD	PIC X(2).
            05  FILLER3	PIC X(2).
            05  CRMTYP	PIC X(1).
            05  CRMBSW	PIC X(1).
            05  FILLER4	PIC X(2).
            05  CRMSW3	PIC X(1).
            05  FILLER5	PIC X(2).
            05  CRCCCC	PIC X(1).
            05  CRCCCD	PIC X(1).
            05  CRLNCR	PIC X(1).
            05  CRLNCB	PIC X(1).
            05  CRINCD	PIC X(1).
            05  CREICM	PIC X(1).
            05  FILLER7	PIC X(1).
            05  CRRCS1	PIC X(1).
            05  FILLER8	PIC X(1).
            05  CRMSW5	PIC X(1).
            05  CRSTYC	PIC X(1).
            05  FILLER9	PIC X(2).
            05  CRGHDD	PIC X(2).
            05  CRDTLN_CRDTSC	PIC X(2).
            05  CRDLPM	PIC X(2).
            05  CRLSOT	PIC X(2).
            05  CRPPSD	PIC X(2).
            05  FILLER10	PIC X(2).
            05  CRFUDT	PIC X(2).
            05  CRPIDT	PIC X(2).
            05  FILLER11	PIC X(3).
            05  CREDAY	PIC X(1).
            05  FILLER12	PIC X(1).
            05  CRMSW7	PIC X(1).
            05  CRLPRM	PIC X(3).
            05  CRAPRM	PIC X(3).
            05  CRPPRM	PIC X(3).
            05  FILLER13	PIC X(6).
            05  CRSOSP	PIC X(1).
            05  CRONCA	PIC X(4).
            05  FILLER14	PIC X(4).
            05  CRFSDD_CRCPRD	PIC X(2).
            05  CRFNDD_CRPPRD	PIC X(2).
            05  FILLER15	PIC X(4).
            05  CREXLC	PIC X(2).
            05  CRAINT	PIC X(2).
            05  CRDDIS	PIC X(2).
            05  FILLER16	PIC X(4).
            05  CRDFDT_CRCRIM	PIC X(3).
            05  FILLER17	PIC X(3).
            05  CRWEBL	PIC X(1).
            05  FILLER17_1	PIC X(3).
            05  CRATDC	PIC X(3).
            05  CRTDCA	PIC X(3).
            05  CREMAT_CRLPDU	PIC X(3).
            05  CRAPDU	PIC X(3).
            05  CRPPDU	PIC X(3).
            05  FILLER18	PIC X(1).
            05  CRMINT	PIC X(4).
            05  FILLER18_1	PIC X(4).
            05  CRRGPA	PIC X(4).
            05  CRPCDC	PIC X(4).
            05  CRTINT	PIC X(4).
            05  CRLSBL	PIC X(4).
            05  FILLER19	PIC X(4).
            05  CRLTDT	PIC X(2).
            05  FILLER19_1	PIC X(2).
            05  CRPAMT	PIC X(4).
            05  CRTIPS	PIC X(4).
            05  CRTIP1	PIC X(4).
            05  CRTIP2	PIC X(4).
            05  CRTIP3	PIC X(4).
            05  CRTIP4	PIC X(4).
            05  FILLER20	PIC X(3).
            05  CRBKSW	PIC X(1).
            05  CRCRDT	PIC X(2).
            05  FILLER21	PIC X(1).
            05  CRSCZN	PIC X(1).
            05  CRLNS1	PIC X(1).
            05  FILLER22	PIC X(3).
            05  CRFPMT	PIC X(4).
            05  CROPMA	PIC X(4).
            05  CRTLCC	PIC X(4).
            05  CRNOTE_CRMRTC_CRTPBL	PIC X(8).
            05  CRCCPP_CRMPTB_CRFASA	PIC X(4).
            05  CRCCPM_CRMPLB_CRCCPY_CRCLCM	PIC X(3).
            05  CRCLCY_CRMP2B_CRCLCP_CRTMPD_CRCIBB	PIC X(9).
            05  CRCPMT	PIC X(4).
            05  CRCPMD	PIC X(2).
            05  CRCDIP	PIC X(2).
            05  CRCTLD	PIC X(3).
            05  FILLER23	PIC X(33).
            05  CRRPDT	PIC X(2).
            05  FILLER23_1	PIC X(2).
            05  CRUBAL	PIC X(4).
            05  CRODLN	PIC X(2).
            05  FILLER24	PIC X(6).
            05  CRINT2	PIC X(1).
            05  CRINR1	PIC X(1).
            05  CRINR2	PIC X(1).
            05  CRINR3	PIC X(1).
            05  CRINR4	PIC X(1).
            05  CRINA1	PIC X(1).
            05  CRINA2	PIC X(1).
            05  CRINA3	PIC X(1).
            05  FILLER25	PIC X(10).
            05  CRLTC1	PIC X(1).
            05  FILLER_25_1	PIC X(1).
            05  CRLTC3	PIC X(1).
            05  CRLLCD	PIC X(1).
            05  CRLLCR_CRRVA3_CRRVAJ	PIC X(2).
            05  CRLLCT	PIC X(2).
            05  CRRFC1	PIC X(1).
            05  CRRFC2	PIC X(1).
            05  CRRFC3	PIC X(1).
            05  CRRFC4	PIC X(1).
            05  CRRFC5	PIC X(1).
            05  FILLER26	PIC X(11).
            05  CRLTC5	PIC X(1).
            05  FILLER26_1	PIC X(10).
            05  CRLFOV	PIC X(1).
            05  CRAHOV	PIC X(1).
            05  CRPROV	PIC X(1).
            05  CRIUOV	PIC X(1).
            05  CRGRDY	PIC X(1).
            05  FILLER26_2	PIC X(7).
            05  CRSTYP	PIC X(1).
            05  CRBRDT	PIC X(2).
            05  FILLER27	PIC X(5).
            05  CRMPCT	PIC X(2).
            05  Filler27_2	PIC X(2).
            05  CROEIT	PIC X(2).
            05  FILLER28	PIC X(2).
            05  CRUPRM	PIC X(3).
            05  CRUICB	PIC X(1).
            05  CRMATD	PIC X(2).
            05  FILLER29_1	PIC X(2).
            05  CRBPTB	PIC X(1).
            05  FILLER30	PIC X(16).
            05  CROCRL	PIC X(3).
            05  Filler30_1	PIC X(12).
            05  CRAOCL	PIC X(3).
            05  Filler30_2	PIC X(8).
            05  CRMSW9	PIC X(1).
            05  CRSCDE	PIC X(2).
            05  FILLER31	PIC X(3).
            05  CRIFAM	PIC X(4).
            05  CRIFCD	PIC X(1).
            05  CRIFC2	PIC X(1).
            05  CRIFC3	PIC X(1).
            05  FILLER32	PIC X(5).
            05  CRIFA2	PIC X(4).
            05  FILLER33	PIC X(10).
            05  CRYTDI	PIC X(4).
            05  FILLER34	PIC X(6).
            05  CRPURD	PIC X(2).
            05  FILLER35	PIC X(5).
            05  CRLPUR	PIC X(1).
            05  FILLER36	PIC X(26).
            05  CROOBR	PIC X(2).
            05  FILLER36_1	PIC X(8).
            05  CRMAPR	PIC X(2).
            05  CRPCDE	PIC X(3).
            05  FILLER37	PIC X(13).
            05  CRNCHG	PIC X(4).
            05  FILLER38	PIC X(10).
            05  CRYLCG	PIC X(3).
            05  FILLER39	PIC X(3).
            05  CRBSSN	PIC X(5).
            05  Filler39_1	PIC X(1).
            05  CRLFEE	PIC X(2).
            05  FILLER40	PIC X(2).
            05  CRAHFE	PIC X(2).
            05  FILLER41	PIC X(2).
            05  CRPRFE	PIC X(2).
            05  FILLER42	PIC X(7).
            05  CRCOUP	PIC X(2).
            05  FILLER43	PIC X(1).
            05  CRPYE1	PIC X(4).
            05  FILLER44	PIC X(6).
            05  CRLCDU	PIC X(3).
            05  FILLER45	PIC X(2).
            05  CRDLQS	PIC X(1).
            05  FILLER46	PIC X(4).
            05  CRMORT	PIC X(1).
            05  CRLVAL	PIC X(1).
            05  CRMBS2	PIC X(1).
            05  CRPRBL	PIC X(4).
            05  FILLER47	PIC X(4).
            05  CRMBS3	PIC X(1).
            05  CRMBS5	PIC X(1).
            05  CRPBSW	PIC X(1).
            05  FILLER48	PIC X(1).
            05  CRTNSF	PIC X(2).
            05  FILLER49	PIC X(19).
            05  CRBROK	PIC X(3).
            05  CRAPP1	PIC X(4).
            05  CRAPP2	PIC X(4).
            05  CRLCCT	PIC X(3).
            05  FILLER50	PIC X(4).
            05  CRMBS7	PIC X(1).
            05  FILLER51	PIC X(1).
            05  CRMBS4	PIC X(1).
            05  FILLER51_1	PIC X(6).
            05  CROTYP	PIC X(1).
            05  CRPPMO	PIC X(1).
            05  CRMBS9	PIC X(1).
            05  CRNCPM	PIC X(2).
            05  FILLER53	PIC X(2).
            05  CRLPIM	PIC X(2).
            05  CRAHTM	PIC X(2).
            05  CRLTRM	PIC X(2).
            05  CRITRM	PIC X(2).
            05  CRCIDU	PIC X(2).
            05  CRVRC1	PIC X(1).
            05  CRVRC2	PIC X(1).
            05  FILLER54	PIC X(4).
            05  CRIFSC	PIC X(4).
            05  FILLER55	PIC X(8).
            05  CRVART	PIC X(2).
            05  FILLER55_1	PIC X(2).
            05  CRRMPA	PIC X(2).
            05  Filler55_2	PIC X(2).
            05  CRCHGA	PIC X(3).
            05  CRECHG	PIC X(3).
            05  FILLER56	PIC X(6).
            05  CRCHG2	PIC X(4).
            05  CRTIP5	PIC X(3).
            05  CRTIP6	PIC X(3).
            05  CRTIP7	PIC X(3).
            05  CRTIP8	PIC X(3).
            05  CRTIP9	PIC X(3).
            05  CRTIPA	PIC X(3).
            05  CRTIPB	PIC X(3).
            05  CRTIPC	PIC X(3).
            05  CRTIPD	PIC X(3).
            05  FILLER57	PIC X(8).
            05  CRMBSD	PIC X(1).
            05  CRPMT1	PIC X(4).
            05  CRPMT2	PIC X(4).
            05  CRPMT3	PIC X(4).
            05  CRPMT4	PIC X(4).
            05  CRPMT5	PIC X(4).
            05  CRPMT6	PIC X(4).
            05  CRPMT7	PIC X(4).
            05  CRPMT8	PIC X(4).
            05  CRPMT9	PIC X(4).
            05  CRPMTA	PIC X(4).
            05  CRPMTB	PIC X(4).
            05  CRPMTC	PIC X(4).
            05  CRPMTD	PIC X(4).
            05  CRUPDU	PIC X(3).
            05  FILLER59	PIC X(23).
            05  CRPCOD	PIC X(2).
            05  FILLER59_1	PIC X(3).
            05  CRMBSF	PIC X(1).
            05  CRIFA3	PIC X(4).
            05  FILLER60	PIC X(11).
            05  CRMBSA	PIC X(1).
            05  Filler60_2	PIC X(13).
            05  CRMBSE	PIC X(1).
            05  CRDUDT	PIC X(2).
            05  FILLER61	PIC X(4).
            05  CRADDT	PIC X(2).
            05  FILLER62	PIC X(6).
            05  CRPCOA	PIC X(4).
            05  FILLER63	PIC X(3).
            05  CRRPST	PIC X(1).
            05  FILLER63_1	PIC X(23).
            05  CRNSC1	PIC X(1).
            05  CRNSC2	PIC X(1).
            05  CRNSC3	PIC X(1).
            05  CRNSC4	PIC X(1).
            05  CRNSC5	PIC X(1).
            05  CRNSC6	PIC X(1).
            05  CRNSC7	PIC X(1).
            05  CRNSC8	PIC X(1).
            05  CRNSC9	PIC X(1).
            05  CRNSCA	PIC X(1).
            05  CRNSCB	PIC X(1).
            05  CRNSCC	PIC X(1).
            05  CRNSCT	PIC X(1).
            05  CRARBL	PIC X(4).
            05  CRARPR	PIC X(4).
            05  CRARIN	PIC X(4).
            05  CRARLC	PIC X(4).
            05  CRAROC	PIC X(4).
            05  FILLER64	PIC X(84).
            05  CRTDRN	PIC X(1).
            05  FILLER64_1	PIC X(3).
            05  CREBAL	PIC X(4).
            05  Filler64_2	PIC X(18).
            05  CRBKRB	PIC X(1).
            05  CRBKRC	PIC X(1).
            05  FILLER65	PIC X(4).
            05  CRYTDF	PIC X(4).
            05  FILLER66	PIC X(5).
            05  CRCHID	PIC X(1).
            05  FILLER67	PIC X(8).
            05  CRMBSB	PIC X(1).
            05  FILLER68	PIC X(129).
            05  CRCFIN	PIC X(4).
            05  CRCFPR	PIC X(4).
            05  FILLER69	PIC X(8).
            05  CROACT	PIC X(4).
            05  CROADT	PIC X(2).
            05  CRANSF	PIC X(2).
            05  CRSCZP	PIC X(2).
            05  FILLER70	PIC X(2).
            05  CRLSDD	PIC X(2).
            05  CRLSDA	PIC X(4).
            05  CRPUFC	PIC X(4).
            05  CRPUAC	PIC X(4).
            05  CRAFAD	PIC X(3).
            05  FILLER71	PIC X(6).
            05  CRLICO	PIC X(1).
            05  CRAICO	PIC X(1).
            05  CRUICO	PIC X(1).
            05  CRPICO	PIC X(1).
            05  CRAHTS	PIC X(2).
            05  CRAHTJ	PIC X(2).
            05  CRGPCO	PIC X(1).
            05  CRLFTS	PIC X(2).
            05  CRLFTJ	PIC X(2).
            05  FILLER73	PIC X(2).
            05  CRTLCL	PIC X(4).
            05  CRGAPC	PIC X(1).
            05  CRACID	PIC X(1).
            05  CRCLOE	PIC X(4).
            05  CROLOE	PIC X(4).
            05  CRSENT	PIC X(4).
            05  CRELOE	PIC X(4).
            05  CRPLCD	PIC X(3).
            05  CRCLMP	PIC X(1).
            05  CRANCI	PIC X(4).
            05  CRMBSG	PIC X(1).
            05  CRSOP3	PIC X(1).
            05  CROSUB	PIC X(1).
            05  FILLER74	PIC X(1).
            05  CRDLCC	PIC X(4).
            05  CRPDLC	PIC X(4).
            05  CRFCRG	PIC X(4).
            05  CRCCPD	PIC X(2).
            05  CRPCPD	PIC X(2).
            05  FILLER75	PIC X(6).
            05  CRTDDT	PIC X(2).
            05  FILLER75_1	PIC X(8).
            05  CRSRD1	PIC X(2).
            05  CRSRR1	PIC X(2).
            05  CRPSA1	PIC X(4).
            05  CRPSD1	PIC X(2).
            05  CRSRD2	PIC X(2).
            05  CRSRR2	PIC X(2).
            05  CRPSA2	PIC X(4).
            05  CRPSD2	PIC X(2).
            05  CRSRD3	PIC X(2).
            05  CRSRR3	PIC X(2).
            05  CRPSA3	PIC X(4).
            05  CRPSD3	PIC X(2).
            05  CRSRD4	PIC X(2).
            05  CRSRR4	PIC X(2).
            05  CRPSA4	PIC X(4).
            05  CRPSD4	PIC X(2).
            05  CRSRD5	PIC X(2).
            05  CRSRR5	PIC X(2).
            05  CRPSA5	PIC X(4).
            05  CRPSD5	PIC X(2).
            05  CRSRD6	PIC X(2).
            05  CRSRR6	PIC X(2).
            05  CRPSA6	PIC X(4).
            05  CRPSD6	PIC X(2).
            05  CRSRD7	PIC X(2).
            05  CRSRR7	PIC X(2).
            05  CRPSA7	PIC X(4).
            05  CRPSD7	PIC X(2).
            05  CRSRD8	PIC X(2).
            05  CRSRR8	PIC X(2).
            05  CRPSA8	PIC X(4).
            05  CRPSD8	PIC X(2).
            05  Filler75_2	PIC X(11).
            05  CRMBSH	PIC X(1).
            05  CRUAID	PIC X(8).
            05  Filler75_4	PIC X(10).
            05  CRGPRM	PIC X(3).
            05  FILLER75_22	PIC X(3).
            05  CRSBDT	PIC X(2).
            05  CREFRT	PIC X(2).
            05  CRIDBA	PIC X(4).
            05  CRAICT	PIC X(4).
            05  CRLAIC	PIC X(4).
            05  FILLER75_3	PIC X(4).
            05  CRDOFD	PIC X(2).
            05  FILLER75_6	PIC X(48).
            05  CRPSLS	PIC X(4).
            05  CRNSFD	PIC X(2).
            05  FILLER75_5	PIC X(5).
            05  CRCRCA	PIC X(4).
            05  CRPRCA	PIC X(4).
            05  CRCRRA	PIC X(4).
            05  CRPRRA	PIC X(4).
            05  Filler75_7	PIC X(7).
            05  CRDCSW	PIC X(1).
            05  Filler75_8	PIC X(1114).
            05  PFCYST	PIC X(15).
            05  PFZIPC	PIC X(3).
            05  FILLER76	PIC X(3).
            05  PFLRSN	PIC X(1).
            05  FILLER77	PIC X(3).
            05  PFCOCC	PIC X(1).
            05  PFSOCC	PIC X(1).
            05  FILLER78	PIC X(2).
            05  PFSTYC	PIC X(1).
            05  FILLER79	PIC X(5).
            05  PFIMGD	PIC X(1).
            05  PFIMGS	PIC X(1).
            05  FILLER80	PIC X(1).
            05  PFCRIM	PIC X(3).
            05  PFCRSC	PIC X(2).
            05  PFBITS	PIC X(1).
            05  FILLER81	PIC X(1).
            05  PFSSFI	PIC X(5).
            05  FILLER81_1	PIC X(9).
            05  PFLANG	PIC X(1).
            05  PFLANS	PIC X(1).
            05  FILLER82	PIC X(64).
            05  PFZIP4	PIC X(2).
            05  PFDPSW	PIC X(1).
            05  PFDPBR	PIC X(5).
            05  PFDPBA	PIC X(17).
            05  PFDPED	PIC X(2).
            05  PFDPAM	PIC X(4).
            05  PFDPCD	PIC X(2).
            05  PFDPCA	PIC X(4).
            05  PFDPDD	PIC X(2).
            05  PFSACT	PIC X(16).
            05  PFSBRH	PIC X(4).
            05  PFORGL	PIC X(1).
            05  PFSAPL	PIC X(3).
            05  FILLER84	PIC X(3).
            05  PFAPHN	PIC X(5).
            05  FILLER85	PIC X(1).
            05  PFCPHN	PIC X(5).
            05  FILLER86	PIC X(1).
            05  PFAPH2	PIC X(5).
            05  PFEADD	PIC X(60).
            05  FILLER87	PIC X(100).
            05  PFLFMX	PIC X(1).
            05  PFAHMX	PIC X(1).
            05  PFIUMX	PIC X(1).
            05  PFBBDT	PIC X(4).
            05  PFCBDT	PIC X(4).
            05  PFMSW2	PIC X(1).
            05  FILLER88	PIC X(3).
            05  PFCLMX	PIC X(3).
            05  PFCLLS	PIC X(3).
            05  PFRANH	PIC X(4).
            05  PFRIUI	PIC X(4).
            05  PFRLFE	PIC X(4).
            05  PFRPPI	PIC X(4).
            05  FILLER89	PIC X(1).
            05  PFSUID	PIC X(20).
            05  FILLER90	PIC X(141).
            05  PFBCID	PIC X(4).
            05  PFCCID	PIC X(4).
            05  PFBFCO	PIC X(2).
            05  PFCFCO	PIC X(2).
            05  PFBVNG	PIC X(2).
            05  PFCVNG	PIC X(2).
            05  Filler90_1	PIC X(122).
            05  PFHMDT	PIC X(2).
            05  Filler90_2	PIC X(11).
            05  PFDLQ1	PIC X(1).
            05  PFDLQ2	PIC X(1).
            05  PFDLQ3	PIC X(1).
            05  PFDACM	PIC X(1).
            05  PFBUNT	PIC X(1).
            05  Filler91	PIC X(144).
            05  PFREAS	PIC X(1).
            05  PFBKRD	PIC X(2).
            05  PFBKRT	PIC X(2).
            05  PFDPTY	PIC X(1).
            05  PFDPDB	PIC X(1).
            05  PFDPD2	PIC X(1).
            05  Filler93	PIC X(8).
            05  PFSKD1	PIC X(2).
            05  PFSKD2	PIC X(2).
            05  PFSKD3	PIC X(2).
            05  PFSKD4	PIC X(2).
            05  PFSKD5	PIC X(2).
            05  PFSKD6	PIC X(2).
            05  PFSKD7	PIC X(2).
            05  PFSKD8	PIC X(2).
            05  PFSKD9	PIC X(2).
            05  PFSKDA	PIC X(2).
            05  PFSKDB	PIC X(2).
            05  PFSKDC	PIC X(2).
            05  FILLER_5_32	PIC X(1667).
            05  XVFDATE	PIC X(4).
            05  XVSDATE	PIC X(4).
            05  XVSTIME	PIC X(4).
            05  XV8BRNO	PIC X(4).
            05  XVBLOE	PIC X(4).
            05  Filler94	PIC X(219).
