        01  RTADAILY.
            05  XCORP		PIC X(2).
            05  XBR		PIC S9(9) COMP-3.
            05  XACCT		PIC X(8).
            05  XALPHA	PIC X(1).
            05  XSECFLAG	PIC X(1).
            05  XCODE		PIC X(2).
            05  XALTCORP	PIC X(2).
            05  XALTBR	PIC S9(9) COMP-3.
            05  XUAID		PIC S9(13) COMP-3.
            05  XOACT		PIC X(8).
            05  XOADT		PIC S9(5) COMP-3.
            05  XDTLN		PIC X(8).
            05  XSCBR		PIC X(4).
            05  XALTSCBR	PIC X(4).
            05  XRECID	PIC X(2).
            05  XCOMP		PIC X(2).
            05  XDATE		PIC S9(4) COMP.
            05  XSEQ		PIC X(4).
            05  XCLOENT	PIC X(4).
            05  XPLRCD	PIC S9(5) COMP-3.
            05  XBRLOENT	PIC X(4).
